import pandas as pd
from parhacheva_def import pass_list


def test_pass_list_save():
    data = pd.DataFrame({'Ид пассажира': [0, 0, 0],
                         'Спасен (да/нет)': [1, 1, 1],
                         'Класс каюты': [0, 0, 0], 'ФИО': [0, 0, 0],
                         'Пол': [0, 0, 0], 'Возраст': [0, 0, 0],
                         'Количество родственников на борту': [0, 0, 0],
                         'Номер билета': [0, 0, 0],
                         'Количество родителей/детей на борту': [0, 0, 0],
                         'Плата за проезд': [0, 0, 0],
                         'Каюта': [0, 0, 0], 'Порт посадки': [0, 0, 0]})
    assert data.equals(pass_list(data, 1)) is True


def test_pass_list_notsave():
    data = pd.DataFrame({'Ид пассажира': [1, 2, 3],
                         'Спасен (да/нет)': [0, 1, 0],
                         'Плата за проезд': [0, 0, 0]})
    data_res = pd.DataFrame({'Ид пассажира': [1, 3],
                             'Спасен (да/нет)': [0, 0],
                             'Плата за проезд': [0, 0]})
    assert pass_list(data, 0)['Ид пассажира'].tolist() \
           == data_res['Ид пассажира'].tolist()


def test_pass_list_notsave_fare():
    data = pd.DataFrame({'Ид пассажира': ['1', '2', '3', '4'],
                         'Спасен (да/нет)': [0, 1, 0, 0],
                         'Плата за проезд': [0, 10, 0, 10]})
    data_res = pd.DataFrame({'Ид пассажира': ['1', '3'],
                             'Спасен (да/нет)': [0, 0],
                             'Плата за проезд': [0, 0]})
    assert pass_list(data, 0)['Ид пассажира'].tolist() \
           == data_res['Ид пассажира'].tolist()
